MyTutorials/incompressible/elbow/elbow_quad/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wall-4
    {
        type            wall;
        inGroups        1(wall);
        nFaces          226;
        startFace       4262;
    }
    pressure-outlet-7
    {
        type            patch;
        nFaces          20;
        startFace       4488;
    }
    velocity-inlet-6
    {
        type            patch;
        nFaces          10;
        startFace       4508;
    }
    velocity-inlet-5
    {
        type            patch;
        nFaces          20;
        startFace       4518;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4400;
        startFace       4538;
    }
)

// ************************************************************************* //
